<?php
	$title = "Competitive Programming - From Zero to Hero";
	include_once($_SERVER['DOCUMENT_ROOT']."/PDP/header.php");	
?>
					<div class="row">
						<div class="col-md-9 col-lg-10 col-sm-8 col-xs-12" >
							<h3 class="center">Κινούμαστε με βελάκια!</h3>
							<p class="mypad">Για να διαβαστεί αποδοτικά το pdf πρέπει να πλοηγούμαστε σωστά σε αυτό, δηλαδή <strong>όχι</strong> με τη ροδέλα!</p>
							<p class="mypad">Θέλουμε πατώντας τα βελάκια (αριστερά και δεξιά) να μας αλλάζει στην προηγούμενη/επόμενη σελίδα, καθώς πολλές διαφάνειες είναι ίδιες με τις προηγούμενες με μία μικρή προσθήκη (προσομοιώνοντας έτσι ένα animation). Θέλουμε λοιπόν να αλλάζουμε αμέσως σελίδα, ώστε το μάτι μας να εντοπίζει άμεσα τις διαφορές.</p>
							<p class="mypad">Ανάλογα με το πρόγραμμα που χρησιμοποιούμε για προβολή pdf η διαδικασία αλλάζει. Σε γενικές γραμμές, αρκεί να δοκιμάσουμε μία μία όλες τις επιλογές για ζουμ (Fit Page, Automatic, Fit Width, Actual Size, etc) και να κάνουμε κλικ μέσα στη διαφάνεια. Κατόπιν δοκιμάζουμε τα βελάκια να δούμε αν μας αλλάζουν αυτόματα σελίδα.</p>
							<p class="mypad">Ζητάμε συγγνώμη για την απλοϊκή οδηγία. Πιστέψτε μας, δε θα την δίναμε αν δεν είχαμε διαπιστώσει ότι κάτι τόσο απλό βοηθάει τόσο πολύ.</p>
						</div>
					</div>

<?php
	include 'footer.html';
?>
