<?php
	$title = "Competitive Programming - From Zero to Hero";
	include_once($_SERVER['DOCUMENT_ROOT']."/PDP/header.php");
?>
					<div class="row">
						<div class="col-md-9 col-lg-9 col-sm-9 col-xs-12">
							<h4 class="center">Προσέγγιση</h4>
							<p class="mypad">Οι λέξεις μήκους Κ είναι 26<sup>Κ</sup>. Η ιδέα είναι να μετρήσουμε τις λέξεις που δεν έχουν κανένα από τους κωδικούς ως substring, και κατόπιν να αφαιρέσουμε αυτό το πλήθος από το 26<sup>Κ</sup>.</p>
							<h4 class="center">Γενικές σκέψεις</h4>
							<p class="mypad">Έστω ότι γνωρίζουμε πόσες λέξεις μήκους <em>Κ-1</em> δεν έχουν κανέναν από τους ζητούμενους κωδικούς <em>και</em> τελειώνουν σε x (όπου x κάποιο κείμενο).</p>
							<p class="mypad">Η βασική παρατήρηση είναι ότι όπως οι λέξεις αυτές θα μεγαλώσουν από μέγεθος <em>Κ-1</em> σε <em>Κ</em>, μπορεί κάποια suffixes, μεγαλώνοντας κατά ένα γράμμα, να γίνουν κωδικοί. Έτσι θα πάψουν αυτές οι λέξεις να μην έχουν κωδικούς.</p>
							<p class="mypad">Αντιλαμβανόμαστε λοιπόν ότι τα κείμενα x που μας ενδιαφέρουν είναι αυτά που είναι prefixes των κωδικών (καθώς μεγαλώνοντας μπορεί να γίνουν κωδικοί).</p>

							<h4 class="center">Λύση</h4>
							<p class="mypad">Έστω amount(x,k) το πλήθος λέξεων μεγέθους k που τελειώνουν σε x, όπου x το μέγιστο prefix κωδικού. Με αυτό εννοούμε ότι αν υπάρχει ένας κωδικός aa, τότε η λέξη baa θεωρούμε ότι τελειώνει σε aa μόνο, παρότι τελειώνει και σε a.</p>
							<p class="mypad">Έστω ότι προσθέτουμε ένα γράμμα στο τέλος μίας λέξης μεγέθους k, η οποία τελειώνει σε x. Με χρήση του δέντρου aho-corasick μπορούμε σε Ο(1) να βρούμε το καινούριο x' στο οποίο τελειώνει η αυξημένη λέξη.</p>
							<p class="mypad">Αν το καινούριο x' είναι ολόκληρος κωδικός, δεν κάνουμε τίποτα. Αν δεν είναι, τότε το amount(x',k+1) αυξάνεται κατά amount(x,k).
Επομένως για να περάσουμε από το <em>k</em> στο <em>k+1</em> αρκεί να ελέγξουμε κάθε ένα από τα 2.000 πιθανά prefix κωδικών και να δοκιμάσουμε να τους προσθέσουμε κάθε ένα από τα 26 γράμματα.</p>
							<p class="mypad">Το άθροισμα όλων των amount(*,K) είναι το πλήθος των λέξεων μήκους Κ που δεν περιέχουν κανένα κωδικό. Το αφαιρούμε από το 26<sup>Κ</sup> και παίρνουμε την απάντηση.</p>

							<h4 class="center">Πολυπλοκότητα</h4>
							<p class="mypad">O(numberOfLetters * totalLengthOfWords * K), δηλαδή 26*2000*5000, και δίνονται 3 δευτερόλεπτα, οπότε είναι αρκετά γρήγορο.</p>
<?php
	include 'footer.html';
?>
